<?php

//Break-point
xdebug_break();

/*
///////////////////////////////////////////////////////////////////////
//////////////////////Настройка в Netbeans/////////////////////////////
///////////////////////////////////////////////////////////////////////
1. Netbeans -> preferences -> PHP -> Debugging
Убрать чекбокс "start on the first line"

2. ПКМ на папке проекта в дереве слева -> Properties -> Run Configuration
Project URL = http://localhost:8080

3. Установить breakpoint в коде

4. Кликнуть на кнопочку (код с маленькой зеленой стрелочкой) чтобы запустился браузер

5. Перейти в Netbeanc и продолжить debug